{
  "contractTemplate": "<h3>Il est établi entre les parties :</h3>\n<p>Le présent contrat est conclu entre le Sender, ci-après dénommé <strong><denomination></strong>, enregistré sous le numéro <strong><siret></strong> (en France), et la société Habitat du Roi, SASU immatriculée au RCS de Narbonne (11100) France, sous le numéro SIRET 939 299 822 00014, ayant son siège social au 6 rue du Marin, 11440 PEYRIAC-DE-MER (FRANCE).</p>\n<p>Ce contrat a pour objet de définir les conditions de faisabilité financière nécessaires au lancement du programme de construction suivant : <strong><program_name></strong>, situé à <strong><city></strong>, <strong><postal_code></strong>, <strong><country></strong>.</p>\n<p><strong>Clause de tiers bénéficiaire :</strong> Bien que le présent contrat soit conclu entre deux entités juridiques, les parties reconnaissent que sa finalité est d’ouvrir la voie à la concrétisation d’une demande structurée. À ce titre, les personnes engagées dans la phase de faisabilité (ci-après les \"Demandeurs\") sont expressément considérées comme <strong>tiers bénéficiaires</strong>. Habitat du Roi s’engage à agir dans le respect de l’intérêt supérieur de ces tiers, notamment en garantissant la transparence du processus et l’effectivité des avantages annoncés. Ce principe engage les parties à respecter les engagements pris envers eux.</p>\n<p>Ce programme immobilier est destiné au marché : <strong><target_audience></strong>.</p>\n<p>Le coût total estimé de l'opération s'élève à <strong><amount></strong> <strong><currency></strong>.</p>\n<p><strong>DeFi :</strong> Afin de permettre le lancement de l'Application Décentralisée conçue pour mettre en phase l'Offre (le projet du Sender) avec la Demande latente et non exprimée, le Sender alimente un fonds initial. Ce fonds, représentant 1/1000e du montant total de l'opération, s'élève à <strong><feasability_fund></strong> USDC (indexé sur le dollar américain).</p>\n<p><strong>Nature des transactions :</strong> Toutes les transactions effectuées dans le cadre du présent contrat suivent le principe du 1/1000e du financement du projet et sont réalisées en USDC.</p>\n<p><strong>Échéance :</strong> Sauf prorogation expresse, la mission sera clôturée à la date suivante : <strong><expiration_date></strong>.</p>\n<p><strong>Objectif :</strong> Habitat du Roi est mandaté par le Sender pour obtenir et accompagner les réservations ainsi que les options d’achat, en vue de sécuriser un minimum de <strong><projected_units></strong> lots.</p>\n<p>Il est expressément convenu entre <strong><denomination></strong> et la société Habitat du Roi que les futurs propriétaires bénéficient d’une réduction des coûts liés à la faisabilité, grâce à leur participation active à son financement.</p>\n<p><strong>Avantages financiers :</strong> En adéquation avec sa mission sur la blockchain, Habitat du Roi garantit une exonération nette de 5 % sur le prix standard du marché du programme immobilier.</p>\n<p>À l’échéance du contrat, ou en cas d’atteinte partielle ou totale de l’objectif, le Sender recevra la liste des personnes ayant participé au processus de faisabilité, avec validation de leur capacité d'achat.</p>\n<p>Lors de la signature du contrat, Habitat du Roi perçoit un montant équivalent à 1/1000e du budget total du programme. Ce financement, incluant les frais de gestion, couvre les coûts opérationnels et permet l'engagement du contrat.</p>\n<p>Une fois le contrat honoré, le solde correspondant au prix du service défini à la signature sera transféré du compte du Sender (<strong><sender_address></strong>) vers le compte d’Habitat du Roi. Le Sender peut également anticiper la conclusion du contrat en accédant directement à certaines données et à la mise en relation avec les personnes engagées dans la faisabilité.</p>\n<p>Le présent contrat ne dispense pas Habitat du Roi de ses obligations et responsabilités envers les tiers, notamment les prospects engagés dans le processus.</p>\n<h5>* En cas de litige, une analyse sera menée afin de garantir aux acheteurs les avantages promis et de faire respecter les engagements pris par l’ensemble des parties.</h5>"
}
