{
  "contractTemplate": "<h3>This agreement is made between:</h3>\n<p>The present contract is concluded between the Sender, hereinafter referred to as <strong><denomination></strong>, registered under number <strong><siret></strong> (in France), and the company Habitat du Roi, a French simplified joint-stock company (SASU) registered with the RCS of Narbonne (11100) under number SIRET 939 299 822 00014, headquartered at 6 rue du Marin, 11440 PEYRIAC-DE-MER (FRANCE).</p>\n<p>This agreement defines the financial feasibility conditions required to initiate the following construction project: <strong><program_name></strong>, located in <strong><city></strong>, <strong><postal_code></strong>, <strong><country></strong>.</p>\n<p><strong>Third-party beneficiary clause:</strong> Although this contract is established between two legal entities, the Parties acknowledge that its purpose is to pave the way for the realization of a structured demand. Therefore, individuals engaged in the feasibility process (hereinafter the “Buyers”) are expressly recognized as <strong>third-party beneficiaries</strong>. Habitat du Roi undertakes to act in accordance with the superior interest of such beneficiaries, ensuring transparency of the process and effectiveness of the benefits announced. This principle commits all Parties to uphold the engagements made toward these buyers.</p>\n<p>This project is intended for the market: <strong><target_audience></strong>.</p>\n<p>The total estimated cost of the operation is <strong><amount></strong> <strong><currency></strong>.</p>\n<p><strong>DeFi:</strong> To launch the Decentralized Application designed to synchronize the Supply (the Sender’s project) with latent, unstructured Demand, the Sender provides an initial fund. This fund, representing 1/1000th of the total project cost, amounts to <strong><feasability_fund></strong> USDC (indexed to the U.S. dollar).</p>\n<p><strong>Transaction structure:</strong> All transactions under this agreement follow the 1/1000th principle of project financing and are conducted in USDC.</p>\n<p><strong>Expiration:</strong> Unless explicitly extended, the mission will be closed on the following date: <strong><expiration_date></strong>.</p>\n<p><strong>Objective:</strong> Habitat du Roi is mandated by the Sender to obtain and accompany reservations and purchase options, aiming to secure a minimum of <strong><projected_units></strong> units.</p>\n<p>It is expressly agreed between <strong><denomination></strong> and Habitat du Roi that future buyers will benefit from reduced feasibility-related costs through their active participation in its funding.</p>\n<p><strong>Financial benefits:</strong> In line with its mission on the blockchain, Habitat du Roi guarantees a 5% net discount on the standard market price of the real estate program.</p>\n<p>At the expiration of this agreement, or if the target is reached in full or in part, the Sender will receive a list of individuals who participated in the feasibility process, along with validation of their purchasing capacity.</p>\n<p>At the time of signing, Habitat du Roi collects a sum equivalent to 1/1000th of the total program budget. This amount, including management fees, covers operational costs and enables the activation of the agreement.</p>\n<p>Once the contract is fulfilled, the remaining service payment as defined at signature will be transferred from the Sender’s account (<strong><sender_address></strong>) to the account of Habitat du Roi. The Sender may also anticipate the contract's conclusion by accessing certain data and initiating contact with participants in the feasibility.</p>\n<p>This agreement does not exempt Habitat du Roi from its obligations and responsibilities toward third parties, particularly prospects engaged in the process.</p>\n<h5>* In the event of a dispute, a joint assessment will be carried out to safeguard the promised benefits for buyers and to enforce the commitments made by all involved parties.</h5>"
}
