{
  "contractTemplate": "<h3>It is established between the parties:</h3><p>This contract is concluded between the Sender, hereinafter referred to as <strong><denomination></strong>, registered under the number <strong><siret></strong> (in France), and the company Habitat du Roi, SASU registered with the RCS of Narbonne (11100) France, under the SIRET number 939 299 822 00014, with its registered office at 6 rue du Marin, 11440 PEYRIAC-DE-MER (FRANCE).</p><p>This contract aims to define the financial feasibility conditions necessary for the launch of the following construction program: <strong><program_name></strong>, located in <strong><city></strong>, <strong><postal_code></strong>, <strong><country></strong>.</p><p>This real estate program is intended for the market: <strong><target_audience></strong>.</p><p>The total estimated cost of the operation amounts to <strong><amount></strong> <strong><currency></strong>.</p><p><strong>DeFi:</strong> In order to enable the launch of the Decentralized Application designed to align the Supply (the Sender's project) with the latent and unexpressed Demand, the Sender funds an initial reserve. This fund, representing 1/1000th of the total operation amount, amounts to <strong><feasability_fund></strong> USDC (pegged to the US dollar).</p><p><strong>Nature of transactions:</strong> All transactions carried out under this contract follow the principle of 1/1000th of the project's funding and are conducted in USDC.</p><p><strong>Deadline:</strong> Unless expressly extended, the mission will be closed on the following date: <strong><expiration_date></strong>.</p><p><strong>Objective:</strong> Habitat du Roi is mandated by the Sender to obtain and facilitate reservations and purchase options to secure at least <strong><projected_units></strong> available lots.</p><p>It is expressly agreed between <strong><denomination></strong> and the company Habitat du Roi that future owners benefit from a reduction in feasibility costs through their active participation in its funding.</p><p><strong>Financial benefits:</strong> In line with its mission on the blockchain, Habitat du Roi guarantees a net exemption of 5% on the standard market price of the program.</p><p>At the contract's expiration, or in the event of partial or total achievement of the objective, the Sender will receive the list of individuals who participated in the feasibility process, with validation of their purchasing capacity.</p><p>Upon signing the contract, Habitat du Roi receives an amount equivalent to 1/1000th of the program's total budget. This funding, including management fees, covers operational costs and allows the contract to be initiated.</p><p>Once the contract is fulfilled, the balance corresponding to the service price defined at signing will be transferred from the Sender's account (<strong><sender_address></strong>) to Habitat du Roi's account. The Sender may also anticipate the contract's conclusion by directly accessing certain data and establishing contact with the individuals engaged in the feasibility process.</p><p>This contract does not exempt Habitat du Roi from its obligations and responsibilities towards third parties, including prospects involved in the process.</p><h5>* In case of dispute, an analysis will be conducted to ensure that buyers receive the promised benefits and that all parties' commitments are upheld.</h5>"
}
